”важаемый јндрей, прошу прощени€, € не смогу сдать ƒ« к 8 уроку,
я затрудн€юсь с прочтением даже вашего кода,
¬ принципе систему и структуру написани€ лото € понимаю, но сложности это прокодить.

я начинаю все заново по вашим урокам, и хочу самосто€тельно пон€ть весь 
материал, + буду еще дополнительно знакомитьс€ с питоном в интернете.

я должен все пон€ть и все написать, так как € хочу заниматьс€ программированием,
 и есть цели создать собственный проект, найти коллектив и внедрить свои идеи 
в общественное пользование. ƒл€ того что бы реализовать планы, € начал 
учить программирование и поступил на факультет в geekbrains »»,
 что бы приблизитс€ к своим иде€м и воплотить мечты. ћне нужно и важно
 освоить не только азы, но и познать все тонкости и все грани программировани€.

(ѕроект)Ёто сделаю либо €, либо кто то другой, в итоге этот проект все равно
 будет, это как колесо или машина, не важно кто первый или когда, но оно это по€витс€.

—пасибо за внимание, и уделенное врем€!
— ”важением, јлександр Ћегкодух.